ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
		<bitfield id="MCAN2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN3_HALTEN" acronym="MSS_CTRL_MCAN3_HALTEN" offset="1068" width="32" description="">
		<bitfield id="MCAN3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN0_HALTEN" acronym="MSS_CTRL_LIN0_HALTEN" offset="1072" width="32" description="">
		<bitfield id="LIN0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN1_HALTEN" acronym="MSS_CTRL_LIN1_HALTEN" offset="1076" width="32" description="">
		<bitfield id="LIN1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN2_HALTEN" acronym="MSS_CTRL_LIN2_HALTEN" offset="1080" width="32" description="">
		<bitfield id="LIN2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN3_HALTEN" acronym="MSS_CTRL_LIN3_HALTEN" offset="1084" width="32" description="">
		<bitfield id="LIN3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN4_HALTEN" acronym="MSS_CTRL_LIN4_HALTEN" offset="1088" width="32" description="">
		<bitfield id="LIN4_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C0_HALTEN" acronym="MSS_CTRL_I2C0_HALTEN" offset="1092" width="32" description="">
		<bitfield id="I2C0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C1_HALTEN" acronym="MSS_CTRL_I2C1_HALTEN" offset="1096" width="32" description="">
		<bitfield id="I2C1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C2_HALTEN" acronym="MSS_CTRL_I2C2_HALTEN" offset="1100" width="32" description="">
		<bitfield id="I2C2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C3_HALTEN" acronym="MSS_CTRL_I2C3_HALTEN" offset="1104" width="32" description="">
		<bitfield id="I2C3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI0_HALTEN" acronym="MSS_CTRL_RTI0_HALTEN" offset="1108" width="32" description="">
		<bitfield id="RTI0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI1_HALTEN" acronym="MSS_CTRL_RTI1_HALTEN" offset="1112" width="32" description="">
		<bitfield id="RTI1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI2_HALTEN" acronym="MSS_CTRL_RTI2_HALTEN" offset="1116" width="32" description="">
		<bitfield id="RTI2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI3_HALTEN" acronym="MSS_CTRL_RTI3_HALTEN" offset="1120" width="32" description="">
		<bitfield id="RTI3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_CPSW_HALTEN" acronym="MSS_CTRL_CPSW_HALTEN" offset="1140" width="32" description="">
		<bitfield id="CPSW_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCRC0_HALTEN" acronym="MSS_CTRL_MCRC0_HALTEN" offset="1144" width="32" description="">
		<bitfield id="MCRC0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCRC0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCRC0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCRC0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN4_HALTEN" acronym="MSS_CTRL_MCAN4_HALTEN" offset="1148" width="32" description="">
		<bitfield id="MCAN4_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN4_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN4_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN4_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN5_HALTEN" acronym="MSS_CTRL_MCAN5_HALTEN" offset="1152" width="32" description="">
		<bitfield id="MCAN5_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN5_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN5_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN5_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN6_HALTEN" acronym="MSS_CTRL_MCAN6_HALTEN" offset="1156" width="32" description="">
		<bitfield id="MCAN6_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN6_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN6_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN6_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN7_HALTEN" acronym="MSS_CTRL_MCAN7_HALTEN" offset="1160" width="32" description="">
		<bitfield id="MCAN7_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="MCAN7_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="MCAN7_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="MCAN7_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI4_HALTEN" acronym="MSS_CTRL_RTI4_HALTEN" offset="1164" width="32" description="">
		<bitfield id="RTI4_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI4_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI4_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI4_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI5_HALTEN" acronym="MSS_CTRL_RTI5_HALTEN" offset="1168" width="32" description="">
		<bitfield id="RTI5_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI5_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI5_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI5_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI6_HALTEN" acronym="MSS_CTRL_RTI6_HALTEN" offset="1172" width="32" description="">
		<bitfield id="RTI6_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI6_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
