ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="RTI6_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI6_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI7_HALTEN" acronym="MSS_CTRL_RTI7_HALTEN" offset="1176" width="32" description="">
		<bitfield id="RTI7_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI7_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI7_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI7_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPTC_DBS_CONFIG" acronym="MSS_CTRL_TPTC_DBS_CONFIG" offset="2048" width="32" description="">
		<bitfield id="TPTC_DBS_CONFIG_TPTC_A1" width="2" begin="5" end="4" resetval="0x0" description="DBS [default burst size] tieoff value for TPTC A1. DBS tieoff defines optimally sized cmd.Both the read and write controller will always issue commands that are less than or equal to the DBS tieoff value. This will typically be on the order of 4 or 8 dataphases worth of data. DBS must always be tied off to no larger than half of the Channel FIFO size. Set DBS to -2'b00 = 16 byte 2'b01 = 32 byte 2'b10 = 64 byte 2'b11 = 128 byte" range="5:4" rwaccess="R/W"/>
	<bitfield id="TPTC_DBS_CONFIG_TPTC_A0" width="2" begin="1" end="0" resetval="0x0" description="DBS [default burst size] tieoff value for TPTC A0. DBS tieoff defines optimally sized cmd.Both the read and write controller will always issue commands that are less than or equal to the DBS tieoff value. This will typically be on the order of 4 or 8 dataphases worth of data. DBS must always be tied off to no larger than half of the Channel FIFO size. Set DBS to -2'b00 = 16 byte 2'b01 = 32 byte 2'b10 = 64 byte 2'b11 = 128 byte" range="1:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPTC_BOUNDARY_CFG" acronym="MSS_CTRL_TPTC_BOUNDARY_CFG" offset="2052" width="32" description="">
		<bitfield id="TPTC_BOUNDARY_CFG_TPTC_A1_SIZE" width="6" begin="13" end="8" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A1Example: Writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="13:8" rwaccess="R/W"/>
	<bitfield id="TPTC_BOUNDARY_CFG_TPTC_A0_SIZE" width="6" begin="5" end="0" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A0Example: Writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="5:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPTC_XID_REORDER_CFG" acronym="MSS_CTRL_TPTC_XID_REORDER_CFG" offset="2056" width="32" description="">
		<bitfield id="TPTC_XID_REORDER_CFG_TPTC_A1_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="Writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A1" range="8" rwaccess="R/W"/>
	<bitfield id="TPTC_XID_REORDER_CFG_TPTC_A0_DISABLE" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_CPSW_CONTROL" acronym="MSS_CTRL_CPSW_CONTROL" offset="2064" width="32" description="">
		<bitfield id="CPSW_CONTROL_RGMII2_ID_MODE" width="1" begin="24" end="24" resetval="0x1" description="Internal delay mode for port 2. Only for TX1'b0 ID mode is disabled1'b1 ID mode is enabled" range="24" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII2_REF_CLK_SEL" width="1" begin="22" end="22" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 1'b0 to get clock will be from IO pad[pad loopback]. Write 1'b1 to get clock from internal loopback." range="22" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII2_REF_CLK_OE_N" width="1" begin="20" end="20" resetval="0x0" description="RMII_REF_CLK IO Output enable control1'b0: Output enable1'b1: Output Disable" range="20" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_PORT2_MODE_SEL" width="3" begin="18" end="16" resetval="0x0" description="Port 2 Interface 3'b000 = MII3'b001 = RMII3'b010 = RGMII011 - 111 = Not Supported" range="18:16" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RGMII1_ID_MODE" width="1" begin="8" end="8" resetval="0x1" description="Internal delay mode for port 1. Only for TX1'b0 ID mode is disabled1'b1 ID mode is enabled" range="8" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII1_REF_CLK_SEL" width="1" begin="6" end="6" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 1'b0 to get clock will be from IO pad[pad loopback]. Write 1'b1 to get clock from internal source" range="6" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII1_REF_CLK_OE_N" width="1" begin="4" end="4" resetval="0x0" description="RMII_REF_CLK IO Output enable control1'b0: Output enable1'b1: Output Disable" range="4" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_PORT1_MODE_SEL" width="3" begin="2" end="0" resetval="0x0" description="Port 1 Interface 3'b000 = MII3'b001 = RMII3'b010 = RGMII011 - 111 = Not Supported" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_OSPI_CONFIG" acronym="MSS_CTRL_OSPI_CONFIG" offset="2068" width="32" description="">
		<bitfield id="OSPI_CONFIG_RTXIP_PENDING" width="3" begin="14" end="12" resetval="0x0" description="Real time xip indication for OSPIWrite 3'b111 for real time xip is pendingWrite 3'b000 for real time xip is doneconfiguration changes must be done when FSS is idle/not configured/no transactions" range="14:12" rwaccess="R/W"/>
	<bitfield id="OSPI_CONFIG_ICLK_SEL" width="3" begin="6" end="4" resetval="0x0" description="Write 3'b111 to switch to loopback clock as OSPI input IO clockWrite 3'b000 to switch to OSPI DQS as OSPI input IO clockconfiguration changes must be done when FSS is idle/not configured/no transactions" range="6:4" rwaccess="R/W"/>
	<bitfield id="OSPI_CONFIG_EXT_CLK" width="3" begin="2" end="0" resetval="0x0" description="Write 3'b111 to external clock as OSPI baud clock source - needed for DFT IO char." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_IDLE_CONTROL" acronym="MSS_CTRL_PRU_ICSS_IDLE_CONTROL" offset="2072" width="32" description="">
		<bitfield id="PRU_ICSS_IDLE_CONTROL_NOGATE" width="1" begin="0" end="0" resetval="0x1" description="Writing 1'b0 will enable local auto-clock gating [lower power] at IP level with increase in access/functional latency. Following IPs are controlled with this signalICSSM" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_GPI_SEL" acronym="MSS_CTRL_PRU_ICSS_PRU0_GPI_SEL" offset="2076" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_GPI_SEL_SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBAR select for ICSM Port03'b000 GPI3'111 PWMXBAR" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_GPI_SEL" acronym="MSS_CTRL_PRU_ICSS_PRU1_GPI_SEL" offset="2080" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_GPI_SEL_SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBAR select for ICSM Port03'b000 GPI3'111 PWMXBAR" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_GPIO_OUT_CTRL" acronym="MSS_CTRL_PRU_ICSS_PRU0_GPIO_OUT_CTRL" offset="2084" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_GPIO_OUT_CTRL_OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 0 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO3'b000 Output Enable3'111 Output Disable" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_GPIO_OUT_CTRL" acronym="MSS_CTRL_PRU_ICSS_PRU1_GPIO_OUT_CTRL" offset="2088" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_GPIO_OUT_CTRL_OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 1 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO3'b000 Output Enable3'111 Output Disable" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_INTAGG_MASK" acronym="MSS_CTRL_TPCC0_INTAGG_MASK" offset="2096" width="32" description="">
		<bitfield id="TPCC0_INTAGG_MASK_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Mask Interrupt from TPTC A1 to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Mask Interrupt from TPTC A0 to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from TPCC A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_MASK_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_INTAGG_STATUS" acronym="MSS_CTRL_TPCC0_INTAGG_STATUS" offset="2100" width="32" description="">
		<bitfield id="TPCC0_INTAGG_STATUS_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Status of Interrupt from TPTC A1. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Status of Interrupt from TPTC A0. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="8" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="7" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from TPCC A Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_INTAGG_MASKWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_INTAGG_STATUS_RAW" acronym="MSS_CTRL_TPCC0_INTAGG_STATUS_RAW" offset="2104" width="32" description="">
		<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Interrupt from TPTC A1. Set irrespective if the Interupt is masked or unmasked in TPCC0_INTAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Interrupt from TPTC A0. Set irrespective if the Interupt is masked or unmasked in TPCC0_INTAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="8" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="7" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="6" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="5" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from TPCC A. Set irrespective if the Interupt is masked or unmasked in TPCC0_INTAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_INTAGG_STATUS_RAW_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL" acronym="MSS_CTRL_INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL" offset="2108" width="32" description="">
		<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_MISC_PERIPH_DYNAMIC_CLK_GATE_EN" width="3" begin="22" end="20" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated" range="22:20" rwaccess="R/W"/>
	<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_MISC_CONFIG1_DYNAMIC_CLK_GATE_EN" width="3" begin="18" end="16" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated" range="18:16" rwaccess="R/W"/>
	<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_MISC_CONFIG0_DYNAMIC_CLK_GATE_EN" width="3" begin="14" end="12" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated" range="14:12" rwaccess="R/W"/>
	<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_PERI_DYNAMIC_CLK_GATE_EN" width="3" begin="10" end="8" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated" range="10:8" rwaccess="R/W"/>
	<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_INFRA_G1_DYNAMIC_CLK_GATE_EN" width="3" begin="6" end="4" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated4 extra clock latency for the first access after the clock is gated and SCRP_PERI is gated" range="6:4" rwaccess="R/W"/>
	<bitfield id="INTERCONNECT_CLK_GATE_DYNAMIC_CONTROL_INFRA_G0_DYNAMIC_CLK_GATE_EN" width="3" begin="2" end="0" resetval="0x0" description="dynamic clock gate feature enable. Multibit writeWrite 0x111 to enable Write 0x000 to disable2 extra clock latency for the first access after the clock is gated and SCRP_PERI is not gated4 extra clock latency for the first access after the clock is gated and SCRP_PERI is gated" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_OSPI_BOOT_CONFIG_MASK" acronym="MSS_CTRL_OSPI_BOOT_CONFIG_MASK" offset="2112" width="32" description="">
		<bitfield id="OSPI_BOOT_CONFIG_MASK_BOOT_SIZE" width="20" begin="19" end="0" resetval="0x0" description="OSPI boot size registerconfiguration changes must be done when FSS is idle/not configured/no transactions" range="19:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_OSPI_BOOT_CONFIG_SEG" acronym="MSS_CTRL_OSPI_BOOT_CONFIG_SEG" offset="2116" width="32" description="">
		<bitfield id="OSPI_BOOT_CONFIG_SEG_BOOT_SEG" width="20" begin="19" end="0" resetval="0x0" description="OSPI segment selector for programmed boot sizeconfiguration changes must be done when FSS is idle/not configured/no transactions" range="19:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_RX_ERR_COUNTER" acronym="MSS_CTRL_PRU_ICSS_RX_ERR_COUNTER" offset="2120" width="32" description="">
		<bitfield id="PRU_ICSS_RX_ERR_COUNTER_MII1_RXERR_CNT" width="8" begin="15" end="8" resetval="0x0" description="Counts the error in MII1_RX_CLK" range="15:8" rwaccess="R"/>
	<bitfield id="PRU_ICSS_RX_ERR_COUNTER_MII0_RXERR_CNT" width="8" begin="7" end="0" resetval="0x0" description="Counts the error in MII0_RX_CLK" range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_PRU_ICSS_RX_ERR_COUNTER_CLR" acronym="MSS_CTRL_PRU_ICSS_RX_ERR_COUNTER_CLR" offset="2124" width="32" description="">
		<bitfield id="PRU_ICSS_RX_ERR_COUNTER_CLR_MII1_RXERR_WRT1CLR" width="1" begin="1" end="1" resetval="0x0" description="Clears the Counter which counts the error in MII1_RX_CLK1'b0: Inactive clear1'b1: Clears the counter" range="1" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_RX_ERR_COUNTER_CLR_MII0_RXERR_WRT1CLR" width="1" begin="0" end="0" resetval="0x0" description="Clears the Counter which counts the error in MII0_RX_CLK1'b0: Inactive clear1'b1: Clears the counter" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LOCK0_KICK0" acronym="MSS_CTRL_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LOCK0_KICK1" acronym="MSS_CTRL_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_INTR_RAW_STATUS" acronym="MSS_CTRL_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
