ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW_MPU_L2_BANK_D_PROT_ERR3" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW_MPU_L2_BANK_C_PROT_ERR3" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW_MPU_L2_BANK_B_PROT_ERR3" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW_MPU_L2_BANK_A_PROT_ERR3" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_WRITE_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_WRITE_DONE" offset="81920" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 7" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 6" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 5" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 4" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 3" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 2" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 1" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_REQ" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_REQ" offset="81924" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE_ACK" offset="81928" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_ACK_PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE" offset="81932" width="32" description="">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc7's mailbox written by ICSSM_PRU" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc6's mailbox written by ICSSM_PRU" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc5's mailbox written by ICSSM_PRU" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc4's mailbox written by ICSSM_PRU" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc3's mailbox written by ICSSM_PRU" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc2's mailbox written by ICSSM_PRU" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc1's mailbox written by ICSSM_PRU" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc0's mailbox written by ICSSM_PRU" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_WRITE_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_WRITE_DONE" offset="81936" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 7" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 6" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 5" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 4" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 3" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 2" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 1" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_REQ" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_REQ" offset="81940" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE_ACK" offset="81944" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_ACK_PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE" offset="81948" width="32" description="">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc7's mailbox written by ICSSM_PRU" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc6's mailbox written by ICSSM_PRU" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc5's mailbox written by ICSSM_PRU" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc4's mailbox written by ICSSM_PRU" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc3's mailbox written by ICSSM_PRU" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc2's mailbox written by ICSSM_PRU" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc1's mailbox written by ICSSM_PRU" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc0's mailbox written by ICSSM_PRU" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_ERRAGG_MASK" acronym="MSS_CTRL_TPCC0_ERRAGG_MASK" offset="98304" width="32" description="">
		<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="26" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="25" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="24" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="18" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_MASK_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_ERRAGG_STATUS" acronym="MSS_CTRL_TPCC0_ERRAGG_STATUS" offset="98308" width="32" description="">
		<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="26" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="25" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="24" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="18" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in TPCC0_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_TPCC0_ERRAGG_STATUS_RAW" offset="98312" width="32" description="">
		<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="26" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="25" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="24" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="18" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="TPCC0_ERRAGG_STATUS_RAW_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in TPCC0_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MMR_ACCESS_ERRAGG_MASK0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_MASK0" offset="98320" width="32" description="">
