ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
		<bitfield id="MMR_ACCESS_ERRAGG_MASK0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="11" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="10" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="9" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_MASK0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS0" offset="98324" width="32" description="">
		<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="11" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="10" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="9" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="8" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="7" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MMR_ACCESS_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS_RAW0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS_RAW0" offset="98328" width="32" description="">
		<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="11" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="10" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="9" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="8" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="7" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="6" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="5" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="4" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="3" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="2" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="1" rwaccess="R/W"/>
	<bitfield id="MMR_ACCESS_ERRAGG_STATUS_RAW0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MMR_ACCESS_ERRAGG_MASK0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_MASK" offset="98432" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_STATUS" offset="98436" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_STATUS_RAW" offset="98440" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_MASK" offset="98448" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_STATUS" offset="98452" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE0_ECC_UNCORR_ERRAGG_STATUS_RAW" offset="98456" width="32" description="">
		<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_MASK" offset="98464" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
