ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_MASK_R5SS0_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_STATUS" offset="98468" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS0_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE1_ECC_CORR_ERRAGG_STATUS_RAW" offset="98472" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_MASK" offset="98480" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_STATUS" offset="98484" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE1_ECC_UNCORR_ERRAGG_STATUS_RAW" offset="98488" width="32" description="">
		<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_MASK" offset="98496" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_MASK_R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_STATUS" offset="98500" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE0_ECC_CORR_ERRAGG_STATUS_RAW" offset="98504" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_MASK" offset="98512" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_STATUS" offset="98516" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE0_ECC_UNCORR_ERRAGG_STATUS_RAW" offset="98520" width="32" description="">
		<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
