ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_MASK" offset="98528" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_MASK_R5SS1_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_STATUS" offset="98532" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_R5SS1_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE1_ECC_CORR_ERRAGG_STATUS_RAW" offset="98536" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_CORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_MASK" offset="98544" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_MASK_R5SS1_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_STATUS" offset="98548" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_R5SS1_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE1_ECC_UNCORR_ERRAGG_STATUS_RAW" offset="98552" width="32" description="">
		<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW_R5SS1_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_MASK" offset="98560" width="32" description="">
		<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS" offset="98564" width="32" description="">
		<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" offset="98568" width="32" description="">
		<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_MASK" offset="98576" width="32" description="">
		<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU1_B1TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS0_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS" offset="98580" width="32" description="">
		<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU1_B0TCM1_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS0_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" offset="98584" width="32" description="">
		<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU1_B0TCM1_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS0_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_TCM_ADDRPARITY_CLR" acronym="MSS_CTRL_R5SS0_TCM_ADDRPARITY_CLR" offset="98592" width="32" description="">
		<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_B1TCM1_ERRADDR_CLR" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5B" range="22:20" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_B1TCM0_ERRADDR_CLR" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5A" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_B0CM1_ERRADDR_CLR" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5B" range="14:12" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_B0TCM0_ERRADDR_CLR" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5A" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_ATCM1_ERRADDR_CLR" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for ATCM of CR5B" range="6:4" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_CLR_ATCM0_ERRADDR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Pulse bit-field Writing 3'b111 clears  the Address latched after parity error for ATCM of CR5A" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS0_CORE0_ADDRPARITY_ERR_ATCM" offset="98596" width="32" description="">
		<bitfield id="R5SS0_CORE0_ADDRPARITY_ERR_ATCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5A" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS0_CORE1_ADDRPARITY_ERR_ATCM" offset="98600" width="32" description="">
		<bitfield id="R5SS0_CORE1_ADDRPARITY_ERR_ATCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B0TCM" offset="98604" width="32" description="">
		<bitfield id="R5SS0_CORE0_ERR_ADDRPARITY_B0TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5A" range="19:0" rwaccess="R"/>
