ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MSS_CTRL_MSS_CTRL_50D00000h.xml
	</register><register id="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B0TCM" offset="98608" width="32" description="">
		<bitfield id="R5SS0_CORE1_ERR_ADDRPARITY_B0TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B1TCM" offset="98612" width="32" description="">
		<bitfield id="R5SS0_CORE0_ERR_ADDRPARITY_B1TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5A" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B1TCM" offset="98616" width="32" description="">
		<bitfield id="R5SS0_CORE1_ERR_ADDRPARITY_B1TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_TCM_ADDRPARITY_ERRFORCE" acronym="MSS_CTRL_R5SS0_TCM_ADDRPARITY_ERRFORCE" offset="98620" width="32" description="">
		<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_B1TCM1" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B1TCM of CR5B" range="22:20" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_B1TCM0" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B1TCM of CR5A" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_B0TCM1" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B0TCM of CR5B" range="14:12" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_B0TCM0" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B0TCM of CR5A" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_ATCM1" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for ATCM of CR5B" range="6:4" rwaccess="R/W"/>
	<bitfield id="R5SS0_TCM_ADDRPARITY_ERRFORCE_ATCM0" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for ATCM of CR5A" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_MASK" offset="98624" width="32" description="">
		<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS" offset="98628" width="32" description="">
		<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" offset="98632" width="32" description="">
		<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_MASK" offset="98640" width="32" description="">
		<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU1_B0TCM1_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_MASK_R5SS1_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS" offset="98644" width="32" description="">
		<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU1_B0TCM1_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_R5SS1_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CORE1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" offset="98648" width="32" description="">
		<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU1_B1TCM1_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU1_B0TCM1_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="R5SS1_CPU1_TCM_ADDRPARITY_ERRAGG_STATUS_RAW_R5SS1_CPU1_ATCM1_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_TCM_ADDRPARITY_CLR" acronym="MSS_CTRL_R5SS1_TCM_ADDRPARITY_CLR" offset="98656" width="32" description="">
		<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_B1TCM1_ERRADDR_CLR" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5B" range="22:20" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_B1TCM0_ERRADDR_CLR" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5A" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_B0CM1_ERRADDR_CLR" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5B" range="14:12" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_B0TCM0_ERRADDR_CLR" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5A" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_ATCM1_ERRADDR_CLR" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:Writing 3'b111 clears  the Address latched after parity error for ATCM of CR5B" range="6:4" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_CLR_ATCM0_ERRADDR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Pulse bit-field Writing 3'b111 clears  the Address latched after parity error for ATCM of CR5A" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS1_CORE0_ADDRPARITY_ERR_ATCM" offset="98660" width="32" description="">
		<bitfield id="R5SS1_CORE0_ADDRPARITY_ERR_ATCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5A" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS1_CORE1_ADDRPARITY_ERR_ATCM" offset="98664" width="32" description="">
		<bitfield id="R5SS1_CORE1_ADDRPARITY_ERR_ATCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS1_CORE0_ERR_ADDRPARITY_B0TCM" offset="98668" width="32" description="">
		<bitfield id="R5SS1_CORE0_ERR_ADDRPARITY_B0TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5A" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS1_CORE1_ERR_ADDRPARITY_B0TCM" offset="98672" width="32" description="">
		<bitfield id="R5SS1_CORE1_ERR_ADDRPARITY_B0TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS1_CORE0_ERR_ADDRPARITY_B1TCM" offset="98676" width="32" description="">
		<bitfield id="R5SS1_CORE0_ERR_ADDRPARITY_B1TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5A" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS1_CORE1_ERR_ADDRPARITY_B1TCM" offset="98680" width="32" description="">
		<bitfield id="R5SS1_CORE1_ERR_ADDRPARITY_B1TCM_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5B" range="19:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_TCM_ADDRPARITY_ERRFORCE" acronym="MSS_CTRL_R5SS1_TCM_ADDRPARITY_ERRFORCE" offset="98684" width="32" description="">
		<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_B1TCM1" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B1TCM of CR5B" range="22:20" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_B1TCM0" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B1TCM of CR5A" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_B0TCM1" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B0TCM of CR5B" range="14:12" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_B0TCM0" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for B0TCM of CR5A" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_ATCM1" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for ATCM of CR5B" range="6:4" rwaccess="R/W"/>
	<bitfield id="R5SS1_TCM_ADDRPARITY_ERRFORCE_ATCM0" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Writing 3'b111 forces  a parity error for ATCM of CR5A" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_PARITY_CTRL" acronym="MSS_CTRL_TPCC0_PARITY_CTRL" offset="98688" width="32" description="">
		<bitfield id="TPCC0_PARITY_CTRL_TPCC_A_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tpcc_a_parity_addr" range="16" rwaccess="R/W"/>
	<bitfield id="TPCC0_PARITY_CTRL_TPCC_A_PARITY_TESTEN" width="1" begin="4" end="4" resetval="0x0" description="parity test enable for tpcc a" range="4" rwaccess="R/W"/>
	<bitfield id="TPCC0_PARITY_CTRL_TPCC_A_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 enables parity for TPCC_A" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPCC0_PARITY_STATUS" acronym="MSS_CTRL_TPCC0_PARITY_STATUS" offset="98692" width="32" description="">
		<bitfield id="TPCC0_PARITY_STATUS_TPCC_A_PARITY_ADDR" width="9" begin="8" end="0" resetval="0x0" description="Address where parity error happened for tpcca" range="8:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_TMU_R5SS0_CORE0_ROM_PARITY_CTRL" acronym="MSS_CTRL_TMU_R5SS0_CORE0_ROM_PARITY_CTRL" offset="98696" width="32" description="">
		<bitfield id="TMU_R5SS0_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tmu0_rom_parity_err_addr" range="16" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS0_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_FORCE_ERR" width="1" begin="1" end="1" resetval="0x0" description="Force parity error on the read interface" range="1" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS0_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 enables parity for TMU0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TMU_R5SS0_CORE0_ROM_PARITY_STATUS" acronym="MSS_CTRL_TMU_R5SS0_CORE0_ROM_PARITY_STATUS" offset="98700" width="32" description="">
		<bitfield id="TMU_R5SS0_CORE0_ROM_PARITY_STATUS_TMU0_ROM_PARITY_ERR_ADDR" width="11" begin="10" end="0" resetval="0x0" description="Address where parity error happened for tmu0" range="10:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_TMU_R5SS0_CORE1_ROM_PARITY_CTRL" acronym="MSS_CTRL_TMU_R5SS0_CORE1_ROM_PARITY_CTRL" offset="98704" width="32" description="">
		<bitfield id="TMU_R5SS0_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tmu1_rom_parity_err_addr" range="16" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS0_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_FORCE_ERR" width="1" begin="1" end="1" resetval="0x0" description="Force parity error on the read interface" range="1" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS0_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 enables parity for TMU1" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TMU_R5SS0_CORE1_ROM_PARITY_STATUS" acronym="MSS_CTRL_TMU_R5SS0_CORE1_ROM_PARITY_STATUS" offset="98708" width="32" description="">
		<bitfield id="TMU_R5SS0_CORE1_ROM_PARITY_STATUS_TMU1_ROM_PARITY_ERR_ADDR" width="11" begin="10" end="0" resetval="0x0" description="Address where parity error happened for tmu1" range="10:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_TMU_R5SS1_CORE0_ROM_PARITY_CTRL" acronym="MSS_CTRL_TMU_R5SS1_CORE0_ROM_PARITY_CTRL" offset="98712" width="32" description="">
		<bitfield id="TMU_R5SS1_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tmu0_rom_parity_err_addr" range="16" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS1_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_FORCE_ERR" width="1" begin="1" end="1" resetval="0x0" description="Force parity error on the read interface" range="1" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS1_CORE0_ROM_PARITY_CTRL_TMU0_ROM_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 enables parity for TMU0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TMU_R5SS1_CORE0_ROM_PARITY_STATUS" acronym="MSS_CTRL_TMU_R5SS1_CORE0_ROM_PARITY_STATUS" offset="98716" width="32" description="">
		<bitfield id="TMU_R5SS1_CORE0_ROM_PARITY_STATUS_TMU0_ROM_PARITY_ERR_ADDR" width="11" begin="10" end="0" resetval="0x0" description="Address where parity error happened for tmu0" range="10:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_TMU_R5SS1_CORE1_ROM_PARITY_CTRL" acronym="MSS_CTRL_TMU_R5SS1_CORE1_ROM_PARITY_CTRL" offset="98720" width="32" description="">
		<bitfield id="TMU_R5SS1_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tmu1_rom_parity_err_addr" range="16" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS1_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_FORCE_ERR" width="1" begin="1" end="1" resetval="0x0" description="Force parity error on the read interface" range="1" rwaccess="R/W"/>
	<bitfield id="TMU_R5SS1_CORE1_ROM_PARITY_CTRL_TMU1_ROM_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 enables parity for TMU1" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TMU_R5SS1_CORE1_ROM_PARITY_STATUS" acronym="MSS_CTRL_TMU_R5SS1_CORE1_ROM_PARITY_STATUS" offset="98724" width="32" description="">
		<bitfield id="TMU_R5SS1_CORE1_ROM_PARITY_STATUS_TMU1_ROM_PARITY_ERR_ADDR" width="11" begin="10" end="0" resetval="0x0" description="Address where parity error happened for tmu1" range="10:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_OSPI0_BUS_SAFETY_CTRL" acronym="MSS_CTRL_OSPI0_BUS_SAFETY_CTRL" offset="99488" width="32" description="">
		<bitfield id="OSPI0_BUS_SAFETY_CTRL_TYPE" width="8" begin="23" end="16" resetval="0x0" description="This bitfield gives a top level idea of the available bus [cmd,wr,ws,rd] for the particular Target/Initiator and whether it follows the VBUS protocol or not. Bit 0 - 1'b1 indicates the Command bus is implemented to this target/initiator else it is set to 1'b0. Bit 1 - 1'b1 indicates the write bus is implemented to this target/initiator else  it is set to 1'b0. Bit 2 - 1'b1 indicates the write status bus is implemented to this target/initiator else it is set to 1'b0. Bit 3 - 1'b1 indicates the read bus is implemented to this target/initiator else  it is set to 1'b0. Bit 4 - 1'b0 indicates the port follows the VBUS protocol else  it is set to 1'b1. Bits 5-7 are set to 3'b000." range="23:16" rwaccess="R"/>
	<bitfield id="OSPI0_BUS_SAFETY_CTRL_ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Set this bit to 1'b1 to clear the error status for this port" range="8" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Set this bit to 3'b111 to enable the safety configuration for this port.  Set this bit to 3'b000 to disable the safety configuration for this port." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_OSPI0_BUS_SAFETY_FI" acronym="MSS_CTRL_OSPI0_BUS_SAFETY_FI" offset="99492" width="32" description="">
		<bitfield id="OSPI0_BUS_SAFETY_FI_SAFE" width="8" begin="31" end="24" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the safe Interconnect. Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="31:24" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_MAIN" width="8" begin="23" end="16" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the main Interconnect.Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="23:16" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_DATA" width="8" begin="15" end="8" resetval="0x0" description="Set bit 0 to 1'b1 to  inject sec and ded faults on [31:0] bits of data bus.Set bit 1 to 1'b1 to  inject sec and ded faults on [64:32] bits of data bus." range="15:8" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_DED" width="1" begin="5" end="5" resetval="0x0" description="Set this bit to 1'b1 inject ded error on data at this port" range="5" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_SEC" width="1" begin="4" end="4" resetval="0x0" description="Set this bit to 1'b1 to inject sec error on data at this port" range="4" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Set this bit 1'b1 to inject fault for request signals on Safe Interconnect." range="3" rwaccess="R/W"/>
	<bitfield id="OSPI0_BUS_SAFETY_FI_GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Set this bit to 1'b1 to inject fault for request signals on main Interconnect." range="2" rwaccess="R/W"/>
